In [ ]:
#Problem: Retrieve employees whose salary is greater than 50,000.

SELECT first_name, last_name, salary 
FROM employees 
WHERE salary > 50000;

In [ ]:
#Problem: Retrieve all employees and order them by their salary in descending order.

SELECT first_name, last_name, salary 
FROM employees 
ORDER BY salary DESC;

In [ ]:
#Problem: Retrieve the top 5 highest-paid employees.

SELECT first_name, last_name, salary 
FROM employees 
ORDER BY salary DESC 
LIMIT 5;

In [ ]:
#Problem: Find the total number of employees in the employees table.

SELECT COUNT(*) AS total_employees 
FROM employees;

In [ ]:
#Problem: Find the total number of employees in each department.

SELECT department, COUNT(*) AS total_employees 
FROM employees 
GROUP BY department;

In [ ]:
#Retrieve all employee names and their corresponding department names from two tables: 
#employees and departments. The employees table has a department_id, and the departments table has id and department_name.

SELECT e.first_name, e.last_name, d.department_name 
FROM employees e
JOIN departments d 
ON e.department_id = d.id;

In [ ]:
SELECT department_name, COUNT(*) AS total_employees FROM employees GROUP BY departments HAVING COUNT(*) >10;

In [ ]:
### Problem: Find departments that have more than 10 employees.

SELECT department, COUNT(*) AS total_employees 
FROM employees 
GROUP BY department 
HAVING COUNT(*) > 10;

In [ ]:
SELECT department,COUNT(*) AS total_employees FROM employees GROUP BY department HAVING COUNT(*) > 10;
UPDATE employess SET salary 60000 WHERE employee_id = 5;
UPDATE employess SET salary 60000 WHERE employess_id = 5;

In [ ]:
###Problem: Update the salary of an employee with employee_id = 5 to 60,000.

UPDATE employees 
SET salary = 60000 
WHERE employee_id = 5;

In [ ]:
UPDATE employees SET salary=60000 WHERE employees_id =5

In [ ]:
## create table

In [ ]:
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,             -- Unique identifier for each employee
    first_name VARCHAR(100) NOT NULL,        -- Employee's first name (cannot be NULL)
    last_name VARCHAR(100) NOT NULL,         -- Employee's last name (cannot be NULL)
    salary DECIMAL(10, 2),                   -- Salary with up to 10 digits and 2 decimal places
    department_id INT                        -- Foreign key column (to link with departments table)
);

In [ ]:
CREATE TABLE employees (emp_id INT PRIMARY KEY, name VARCHAR(100), salary DECIMAL(10,2), department VARCHAR(10));
INSERT INTO employees values (1,'Ajit', 50000,'AI');

In [ ]:
CREATE TABLE employees (emp_id INT PRIMARY KEY, name VARCHAR(100), salary INT, department_idINT);
INTER INTO employess values(1,'ajit',14,4)

In [ ]:
## add data in table

INSERT INTO employees (employee_id, first_name, last_name, salary, department_id)
VALUES (1, 'John', 'Doe', 50000.00, 2);

In [ ]:
INERT INTO emplotyee(employee_id,name,department,salary,department_id) VALUES(1,'John','IT',50000,2)

In [ ]:
#Creating a Table with a Foreign Key
#Let's assume we have two tables: departments and employees. 
#The employees table will have a foreign key reference to the departments table.

In [ ]:
#-- Create the 'departments' table
CREATE TABLE departments (
    department_id INT PRIMARY KEY,
    department_name VARCHAR(100) NOT NULL
);

#-- Create the 'employees' table with a foreign key referencing 'departments'
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    first_name VARCHAR(100),
    last_name VARCHAR(100),
    department_id INT,  -- This will be the foreign key
    FOREIGN KEY (department_id) REFERENCES departments(department_id)
);

In [ ]:
CREATE TABLE employees(emp_id INT PRIMARY KEY, name VARCHAR(100), departytment INT, 
                       
                       FOREIGN KEY (department_id) REFERENCES departments(department_id))

In [ ]:
#Adding a Foreign Key to an Existing Table
#If you already have two tables and want to add a foreign key to one of them, you can use the ALTER TABLE statement.

In [ ]:
#-- Add a foreign key to the 'employees' table

ALTER TABLE employees 
ADD CONSTRAINT fk_department
FOREIGN KEY (department_id) REFERENCES departments(department_id);

In [ ]:
##Description: Returns only the records that have matching values in both tables.

SELECT e.first_name, e.last_name, d.department_name
FROM employees e
INNER JOIN departments d
ON e.department_id = d.department_id;

In [ ]:
SELECT e.name,d.department FROM employess e INNER JOIN departments d ON e.department_id = d.department_id;

In [ ]:
##Description: Returns all records from the left table (employees), 
##and the matched records from the right table (departments). If there's no match, it returns NULL for the right table.

SELECT e.first_name, e.last_name, d.department_name
FROM employees e
LEFT JOIN departments d
ON e.department_id = d.department_id;

In [ ]:
#Description: Returns all records from the right table (departments),
#and the matched records from the left table (employees). If there's no match, it returns NULL for the left table.

SELECT e.first_name, e.last_name, d.department_name
FROM employees e
RIGHT JOIN departments d
ON e.department_id = d.department_id;

In [ ]:
##Description: Returns all records when there is a match in either table. 
#Records without a match in one of the tables will contain NULL values.

SELECT e.first_name, e.last_name, d.department_name
FROM employees e
FULL OUTER JOIN departments d
ON e.department_id = d.department_id;

In [ ]:
#CROSS JOIN Description: Returns the Cartesian product of both tables.
#Every row in the left table is combined with every row in the right table.

SELECT e.first_name, e.last_name, d.department_name
FROM employees e
CROSS JOIN departments d;

In [ ]:
SELECT e.employee_id,e.name,d.department_name FROM employees CROSS JOIN department d;

In [ ]:
#SELF JOIN
#Description: A self-join is used to join a table with itself.
#Problem: Find employees who work in the same department.

SELECT e1.first_name AS Employee1, e2.first_name AS Employee2, e1.department_id
FROM employees e1
JOIN employees e2
ON e1.department_id = e2.department_id AND e1.employee_id != e2.employee_id;

In [ ]:
#Query to Get the Maximum Salary for Each Department:

SELECT department_id, MAX(salary) AS max_salary
FROM employees
GROUP BY department_id;

In [ ]:
SELECT name,salary FROM employees WHERE salary > (SELECT AVG(salary) FROM employees) AS avg_salary;
SELECT MAX(salary) FROM employees WHERE salary < (SELECT MAX(salary) FROM employees)

In [ ]:
SELECT department_id, MAX(salary) AS max_salary FROM employess GROUP BY department_ids;
SELECT name,salary FROM employee where salary >(SELECT AVG(salary) FROM employees);

In [ ]:
#Problem: Find employees whose salary is higher than the average salary of all employees.

SELECT first_name, last_name, salary
FROM employees
WHERE salary > (SELECT AVG(salary) FROM employees);

In [ ]:
### Problem: Find departments that have more than 10 employees.

SELECT department, COUNT(*) AS total_employees 
FROM employees 
GROUP BY department 
HAVING COUNT(*) > 10;

In [ ]:
SELECT department, COUNT(*)AS total_employees FROM employees GROUP BY department HAVING COUNT(*) >10;

In [ ]:
#Problem: Retrieve each employee's salary and the average salary for the entire company.

SELECT first_name, last_name, salary,
       (SELECT AVG(salary) FROM employees) AS avg_salary
FROM employees;

In [ ]:
SELECT department_name,MAX(salary) AS max_salary FROM employees GROUP BY department_name;

In [ ]:
#Problem: Find the highest-paid employees in each department by using a subquery as a derived table.

SELECT department_id, MAX(salary) AS max_salary
FROM employees
GROUP BY department_id;

In [ ]:
SELECT department_id,MAX(salalry) As max_salary FROM employees GROUP BY departmernt_id;
SELECT department_id, MAX(salary) AS max_salary FROM employess GROUP BY department_id;

In [ ]:
##Problem: Update the first_name to 'Michael' and salary to 70,000 for the employee with employee_id = 4.

UPDATE employees
SET first_name = 'Michael', salary = 70000
WHERE employee_id = 4;

In [ ]:
## Self-Join Find pairs of employees working in the same department.

SELECT e1.name AS employee_1, e2.name AS employee_2, e1.department
FROM employees e1
JOIN employees e2
ON e1.department = e2.department AND e1.id != e2.id;

In [1]:
# Rank employees by their salary within each department.

SELECT name, department, salary, 
       RANK() OVER (PARTITION BY department ORDER BY salary DESC) AS rank
FROM employees;

In [ ]:
SELECT name,department,salary RANK() OVER(PARTITION BY department ORDER BY salary DES) AS rank FROM employees;

14. CTEs (Common Table Expressions)
Find the total salary and average salary for employees, then filter only departments with a total salary > 100,000.

In [ ]:
WITH DepartmentSalary AS (
    SELECT department, SUM(salary) AS total_salary, AVG(salary) AS average_salary
    FROM employees
    GROUP BY department
)
SELECT *
FROM DepartmentSalary
WHERE total_salary > 100000;

In [ ]:
WITH DepartmentSalary As (SELECT department, SUM(salary) AS total_salary, 
                          AVG(salary) AS average_salary FROM employees GROUB BY department)
SELECT * FROM DepartmentSalary WHERE total_salary > 100000;

In [ ]:
## Combine results from two tables, current_employees and former_employees.

SELECT name, department 
FROM current_employees
UNION
SELECT name, department 
FROM former_employees;

In [ ]:
SELECT name,salary FROM employees UNION SELECT name, salary FROM former_employees;
SELECT MAX(salary) AS second_max_salary FROM employees WHERE salary < (SELECT MAX(salary) FROM employees)

In [ ]:
# EXCEPT Find employees who are not working on any projects.

SELECT id, name
FROM employees
EXCEPT
SELECT employee_id, name
FROM projects;

In [ ]:
# DELETE FROM employees/

WHERE joining_date < '2020-01-01';

In [ ]:
# Find Second Highest Salary Find the second highest salary in the employees table

SELECT MAX(salary) AS second_highest_salary
FROM employees
WHERE salary < (SELECT MAX(salary) FROM employees);

In [ ]:
SELECT MAX(salary) AS second_high_salary FROM employees WHERE salary < (SELECT MAX(salary) FROM employees)